[
    {'title': 'CP chief Dhanin tops Thailand wealth list with $15bn',
  'description': 'Dhanin Chearavanont , senior chairman of the Charoen Pokphand (CP) Group, leads the list of Thailand&rsquo;s richest people on on the Forbes magazine World&rsquo;s Billionaires 2025 list, with a net worth of US$15.2 billion.',
  'content': 'Dhanin Chearavanont, senior chairman of the Charoen Pokphand (CP) Group, leads the list of Thailand’s richest people on on the Forbes magazine World’s Billionaires 2025 list, with a net worth of US$15.2 billion. He is ranked 141st among 3,
        028 billionaires on the list. The United States has a record 902 billionaires, followed by China (516, including Hong Kong) and India (205). Thailand has 25 billionaires on the list. Globally, Forbes said,
        15 people have a net worth of at least $100 billion each. In Thailand, Mr Dhanin,
        85, is followed by Sarath Ratanavadi, CEO of Gulf Development Plc, who has a net worth of $12.9 billion and is 184th on the global list. Charoen Sirivadhanabhakdi, chairman of Thai Beverage Plc, is ranked third with $11.7 billion and is 210th on the global list. Former prime minister Thaksin Shinawatra is 15th among Thailand’s richest and 1,
        688th on the world list with a net worth of $2.1 billion. Globally, Elon Musk, the co-founder of Tesla and now Donald Trump’s cost-cutter-in-chief, tops the table with a net worth of $342 billion, followed by Mark Zuckerberg of Facebook with $216 billion and Jeff Bezos of Amazon with $215 billion.',
  'image': 'https: //static.bangkokpost.com/media/content/20250405/c1_2996442_250405215817_700.jpg',
  'site_url': 'https: //www.bangkokpost.com/business/general/2996442/cp-chief-dhanin-tops-thailand-wealth-list-with-15bn',
  'publish_date': '5 Apr 2025',
  'publish_time': '21: 57'
    },
    {'title': 'Another body spotted at building collapse site',
  'description': 'Another body has been spotted beneath the rubble of the collapsed State Audit Office in Bangkok, but it cannot be retrieved until more debris is cleared, officials said on Saturday.',
  'content': 'Another body has been spotted beneath the rubble of the collapsed State Audit Office in Bangkok, but it cannot be retrieved until more debris is cleared, officials said on Saturday. Rescuers have been working tirelessly to excavate Zone C of the site in Chatuchak district, as it is believed to be the place where many people ran from as the building collapsed during the earthquake on March 28. Aekvarunyoo Amrapala, a spokesman of the Bangkok Metropolitan Administration (BMA), said a backhoe was being used to dig a hole in Zone C, which was linked to the building’s car park floors. It is possible that the bodies of some of the workers who were fleeing during the collapse would be found there, he said. A total of 79 people are still unaccounted for at the site where the 30-storey building collapsed. A small backhoe has been deployed to Zone B but a larger one is needed to reduce the debris pile and lessen the risks for rescuers who will attempt to retrieve bodies of missing people there, said the spokesman. At about 2.30am, Mr Aekvarunyoo received a report that a body had been spotted trapped under the rubble in Zone B, but rescuers were unable to go inside yet. The BMA’s Erawan Medical Emergency Centre reported on Saturday evening that the confirmed death toll at the site stood at 15 and the number of injured was 19. Of the injured,
        11 have been discharged from hospitals, leaving 8 being treated.',
  'image': 'https: //static.bangkokpost.com/media/content/20250405/c1_2996412_700.jpg',
  'site_url': 'https: //www.bangkokpost.com/thailand/general/2996412/another-body-spotted-at-building-collapse-site',
  'publish_date': '5 Apr 2025',
  'publish_time': '20: 35'
    },
    {'title': 'India and UAE to develop Sri Lanka energy hub',
  'description': 'COLOMBO - India and the United Arab Emirates have agreed to develop an energy hub in Sri Lanka, the Indian foreign ministry said on Saturday, as New Delhi&rsquo;s competition with China grows in the Indian Ocean island nation.',
  'content': 'COLOMBO - India and the United Arab Emirates have agreed to develop an energy hub in Sri Lanka, the Indian foreign ministry said on Saturday, as New Delhi’s competition with China grows in the Indian Ocean island nation. The three nations signed the pact for the hub during Indian Prime Minister Narendra Modi’s visit to Sri Lanka, the first by a global leader since Sri Lankan President Anura Kumara Dissanayake took office in September. New Delhi and Colombo have worked to deepen ties as India’s southern neighbour recovers from a severe financial crisis triggered in 2022, during which India provided $4 billion in financial assistance. Saturday’s agreement boosts New Delhi’s competition with China, whose state energy firm Sinopec has signed a deal to build a $3.2-billion oil refinery in the southern port city of Hambantota. The energy hub in the strategically important city of Trincomalee, a natural harbour in the Sri Lanka’s east, will involve construction of a multi-product pipeline and may include using a World War II tank farm partly held by the Sri Lankan subsidiary of Indian Oil Corp, Indian Foreign Secretary Vikram Misri told reporters in Colombo. “The UAE is a strategic partner for India in the energy space and therefore was an ideal partner for this exercise that is being done for the first time in the region,” Misri said. “The exact contours of the UAE’s role will be elaborated once the business-to-business discussions kick off.” The three nations will next choose business entities that will consider the financing and feasibility of projects for the hub, he said. Modi also inaugurated a $100-million solar power project, a joint venture between Ceylon Electricity Board and India’s National Thermal Power Corp. India and Sri Lanka also concluded their debt restructuring process, Misri said. Sri Lanka owes about $1.36 billion in loans to the Exim Bank of India and State Bank of India, according to Sri Lankan Finance Ministry data. Colombo began restructuring talks after it defaulted on its debt in May 2022, signing a preliminary deal with bilateral creditors Japan, India and China last June. India and Sri Lanka also signed pacts on power grid connectivity, digitisation, security and healthcare.',
  'image': 'https: //static.bangkokpost.com/media/content/20250405/c1_2996402_250405190756_700.jpg',
  'site_url': 'https: //www.bangkokpost.com/world/2996402/india-and-uae-to-develop-sri-lanka-energy-hub',
  'publish_date': '5 Apr 2025',
  'publish_time': '19: 03'
    },
    {'title': 'UK couple happy to be home after Thailand ordeal',
  'description': 'A British couple whose Thailand retirement dream turned into a nightmare are back home and say they &ldquo;couldn&rsquo;t be happier&rdquo; as they prepare to rebuild their lives.',
  'content': 'A British couple whose Thailand retirement dream turned into a nightmare are back home and say they “couldn’t be happier” as they prepare to rebuild their lives. “I wish we’d never gone to Thailand but we can’t turn the clock back and Des and I are going to have a wonderful retirement together,” Mary Byrne,
        69, told the BBC. She and her husband Des,
        77, were badly beaten by two neighbours after a property dispute in Hua Hin, where they had purchased a villa. They said they acted in self-defence but feared they would be jailed when Thai authorities said they and their assailants would all face charges. \xa0 The incident took place in December 2023 but the charges were not laid until June last year. The couple’s passports were seized and they endured a months-long wait to learn of their fate. Last month the couple finally appeared in court, where they were fined and had their passports returned to them. They have now abandoned their plans to retire in Thailand and are instead looking at houses in Middlesbrough. “Being back in Middlesbrough and seeing the fabulous countryside, it’s absolutely wonderful,” Mrs Byrne told the BBC. “We couldn’t be happier.” Since getting back to England the couple have stayed with a family in Berkshire but plan to settle back on their native Teesside once they find a home. Mrs Byrne said: “We are recovering and coming home has made it so much easier. We’re elated, the emotions are so high at being back at home.”',
  'image': 'https: //static.bangkokpost.com/media/content/20250405/c1_2996427_700.jpg',
  'site_url': 'https: //www.bangkokpost.com/thailand/general/2996427/uk-couple-happy-to-be-home-after-thailand-ordeal',
  'publish_date': '5 Apr 2025',
  'publish_time': '20: 20'
    },
    {'title': 'USAID team fired during Myanmar quake mission',
  'description': 'Three US aid workers were laid off while in Myanmar helping the rescue and recovery from the country&rsquo;s massive earthquake, a former senior staffer said, as the Trump administration&rsquo;s dismantling of foreign aid affects its disaster response.',
  'content': 'Three US aid workers were laid off while in Myanmar helping the rescue and recovery from the country’s massive earthquake, a former senior staffer said, as the Trump administration’s dismantling of foreign aid affects its disaster response. After travelling to the Southeast Asian country, the three staff were told late this week that they would be let go, Marcia Wong, a former official at the US Agency for International Development (USAID), told Reuters. “This team is working incredibly hard, focussed on getting humanitarian aid to those in need. To get news of your imminent termination — how can that not be demoralising?” said Wong, former deputy administrator of the agency’s Bureau for Humanitarian Assistance, which oversees Washington’s disease response efforts overseas. President Donald Trump’s government has pledged at least $9 million to Myanmar after the magnitude-7.7 quake, which has killed more than 3,
        300 people. But his administration’s massive cuts to USAID have hindered its ability to respond, while China, Russia, India and other nations have rushed in assistance. The Trump administration has moved to fire nearly all USAID staff in recent weeks, as billionaire Elon Musk’s Department of Government Efficiency has slashed funding and dismissed contractors across the federal bureaucracy in what it calls an attack on wasteful spending. The three USAID workers have been sleeping on the streets in the earthquake zone, Wong said, adding that their terminations would take effect in a few months. Many residents have been sleeping outside for fear of aftershocks and further building collapses. Wong said she is in contact with remaining USAID staff and that she heard about the terminations after an all-staff meeting on Friday. Former staff say most of the people who would have coordinated the response have been let go, while third-party implementing partners have lost contracts. \xa0 The US State Department did not immediately respond to a request for comment. Secretary of State Marco Rubio on Friday rejected criticism that Washington was slow to respond to the March 28 earthquake because USAID was dismantled. Rather, he told reporters in Brussels, Myanmar was not “the easiest place to work”, saying the military government does not like the United States and prevents it from operating in the country as it wants to. The United Nations has said the junta was limiting humanitarian aid. Rubio said the US would no longer be the world’s top humanitarian donor, accounting for what he estimated was 70% of all global relief funding. He has called on other wealthy nations to step up in assisting Myanmar.',
  'image': 'https: //static.bangkokpost.com/media/content/20250405/c1_2996386_250405180735_700.jpg',
  'site_url': 'https: //www.bangkokpost.com/world/2996386/usaid-team-fired-during-myanmar-quake-mission',
  'publish_date': '5 Apr 2025',
  'publish_time': '18: 02'
    },
    {'title': 'Manila sees Beijing’s arrests of ‘spies’ as retaliation',
  'description': 'The Philippines said the detention of three Filipinos in China for alleged espionage may be in retaliation for Manila&rsquo;s recent arrests of Chinese nationals accused of spying.',
  'content': 'The Philippines said the detention of three Filipinos in China for alleged espionage may be in retaliation for Manila’s recent arrests of Chinese nationals accused of spying. The Filipinos were former scholars of the Hainan provincial government under an agreement with Palawan province in the Philippines, the National Security Council said in a statement on Saturday without identifying the individuals. They have no military training “with no criminal records and were vetted and screened by the Chinese government prior to their arrival there”, it said. “Given the limited information released by Chinese media, the arrests can be seen as a retaliation for the series of legitimate arrests of Chinese agents and accomplices by Philippine law enforcement and counter-intelligence agencies in recent months,” the statement read. Beijing said on Thursday that it had detained three Filipinos who it claimed were operatives for Manila and carried out secret intelligence tasks in China. It said the espionage case against David Servañez, Albert Endencia and Nathalie Plizardo is under investigation. The latest flare-up could heighten tensions between the two countries that are already engaged in a territorial dispute in the South China Sea, as Manila pushes back against Beijing’s expansive claims in the resource-rich waterway. Philippine authorities arrested several Chinese nationals earlier this year for alleged espionage, including six last month who were suspected of carrying out intelligence and surveillance operations of critical infrastructure in the country. President Ferdinand Marcos Jr earlier said he was “very disturbed” over the increasing number of alleged Chinese spies arrested in the Philippines, which has prompted security officials to tighten monitoring. The Philippines’ security council said that a video released by China’s state broadcaster in which the three Filipinos expressed regret “appear to be scripted, strongly suggesting that (the confessions) were not made freely”. The security council said it was working with the Department of Foreign Affairs and the Philippine embassy in Beijing to ensure that the Filipinos receive appropriate legal support and are accorded due process. “We urge the Chinese government to respect their rights and afford them every opportunity to clear their names in the same way that the rights of Chinese nationals are respected here in the Philippines,” it added.',
  'image': 'https: //static.bangkokpost.com/media/content/20250405/c1_2996376_250405162825_700.jpg',
  'site_url': 'https: //www.bangkokpost.com/world/2996376/manila-sees-beijings-arrests-of-spies-as-retaliation',
  'publish_date': '5 Apr 2025',
  'publish_time': '16: 27'
    },
    {'title': 'Din Daeng toll plaza closing at night from Saturday to Monday',
  'description': 'The inbound and outbound lanes of the Din Daeng toll plaza on the Chalerm Maha Nakhon Expressway in Bangkok will be closed at night from Saturday until Monday to accommodate the removal of a construction crane tower that was damaged in the March 28 earthquake .',
  'content': 'The inbound and outbound lanes of the Din Daeng toll plaza on the Chalerm Maha Nakhon Expressway in Bangkok will be closed at night from Saturday until Monday to accommodate the removal of a construction crane tower that was damaged in the March 28 earthquake. The Expressway Authority of Thailand (Exat) said the closure would take place from 10pm to 6am on April 5-7. The crane tower in question was being used at the Aspire Vibha-Victory condominium project site and its collapse also affected the expressway, Exat said on its Facebook page. Exat apologised for any inconvenience and advised motorists to use the following alternative routes. Outbound: Vehicles travelling on the Chalerm Maha Nakhon Expressway from Rama V Road (Bon Kai) should use the Si Rat Expressway heading towards Phahon Yothin Road (Victory Monument) exit or the Rama IX (Ratchada) exit to enter Din Daeng and Vibhavadi roads. Vehicles travelling on the Si Rat Expressway should use the Ploenchit exit (north side) to reach Asok Road and head towards Din Daeng and Vibhavadi roads. Inbound: Vehicles heading to Bang Na should use the Si Rat Expressway at the Bang Sue toll plaza in front of Mor Chit Bus Terminal 2 or Klong Prapa 2 toll plaza in front of the Ministry of Finance. The damaged crane tower is seen at the Aspire Vibha-Victory condominium construction site in Din Daeng district of Bangkok on March 29. (Photo: Din Daeng District Office Facebook page)',
  'image': 'https: //static.bangkokpost.com/media/content/20250405/c1_2996356_700.jpg',
  'site_url': 'https: //www.bangkokpost.com/thailand/general/2996356/din-daeng-toll-plaza-closing-at-night-from-saturday-to-monday',
  'publish_date': '5 Apr 2025',
  'publish_time': '15: 42'
    },
    {'title': 'Chinese tourist found dead on Pattaya beach',
  'description': 'A Chinese tourist holding a Thailand Privilege Card visa was found dead on a beach in Pattaya on Saturday morning, with some bruises on his forehead and neck.',
  'content': 'A Chinese tourist holding a Thailand Privilege Card visa was found dead on a beach in Pattaya on Saturday morning, with some bruises on his forehead and neck. The body of the 40-year-old man, whose name was withheld pending notification of relatives, was found lying face-down on Yin Yom beach behind a hotel in South Pattaya, said Pol Lt Col Saijai Khamjulla, investigation inspector at the Pattaya City police station, who was alerted at 7.30am. Wearing a white T-shirt and jeans, the man had some bruises — one on his forehead and one on his neck. His right eye socket was fractured and there were traces of blood from his nostrils, according to an initial examination. A doctor believed he had died at least six to 12 hours before the body was discovered. A mobile phone and a slipper were found near his body. A passport and a bank passbook showing 60,
        000 baht cash were found on his body. According to police, a hotel staff member was cleaning the beach area behind the hotel and saw the man lying face-down in the sand. She immediately alerted police and said the man was not a guest of the hotel. An immigration record check showed the man entered Thailand on a tourist visa under the Thailand Privilege Card scheme for wealthy frequent visitors. He first entered the kingdom in 2023 and travelled in and out of the country frequently. His last reported address was in the seaside village of Jomtien, about 2-3 kilometres from where the body was found. Pol Col Anek Srathongyu, chief of the Pattaya City station, said the exact cause of death had not yet been established. The report of the doctor who examined the body said it was possible that the deceased had slipped and fallen, with his head striking a rock, causing him to lose consciousness. He might have later drowned in the sea, said the police chief. The body would be sent to Police General Hospital in Bangkok for a full autopsy to establish the cause of death, said Pol Col Anek.',
  'image': 'https: //static.bangkokpost.com/media/content/20250405/c1_2996392_700.jpg',
  'site_url': 'https: //www.bangkokpost.com/thailand/general/2996392/chinese-tourist-found-dead-on-pattaya-beach',
  'publish_date': '5 Apr 2025',
  'publish_time': '18: 24'
    },
    {'title': 'Arsenal draw at Everton leaves Liverpool smiling',
  'description': 'LIVERPOOL, England - Everton did neighbours Liverpool a massive favour by holding title-chasing Arsenal to a 1-1 Premier League draw at Goodison Park on Saturday.',
  'content': 'LIVERPOOL, England - Everton did neighbours Liverpool a massive favour by holding title-chasing Arsenal to a 1-1 Premier League draw at Goodison Park on Saturday. Iliman Ndiaye’s penalty cancelled out a Leandro Trossard opener for the visitors, who now have 62 points from 31 matches,
        11 behind leaders Liverpool, who have a game at hand when they go to Fulham on Sunday. Everton climb to 14th place with 35 points from their 31 matches,
        15 points clear of the relegation zone. Arsenal took the lead in the 34th minute with the first shot on target in the game as a poor header in midfield allowed Raheem Sterling to race clear and feed Trossard, who took a touch and drilled his shot low into the far right corner. Everton were awarded a penalty two minutes into the second half when Myles Lewis-Skelly hauled down Jack Harrison in the box and Ndiaye netted his ninth goal of the season in all competitions to leave Arsenal’s flagging title hopes in tatters. Liverpool now need just 11 points from their remaining eight matches to secure a record-equalling 20th English top-flight title. Arsenal boss Mikel Arteta had said the best preparation for his side’s Champions League quarter-final, first leg against Real Madrid would be to win on Merseyside on Saturday. But the Spaniard showed he had one eye on the visit of the European champions with his team selection. Bukayo Saka was forced to wait for his first start since December as the England international was left on the bench alongside Martin Odegaard, Gabriel Martinelli, Jurrien Timber and Thomas Partey. Despite also missing Gabriel Magalhaes, Kai Havertz and Gabriel Jesus to long-term injuries, Arsenal were still the dominant force in the first 45 minutes. Arsenal’s title bid, though, has been undone throughout the season by not scoring enough goals, even when Havertz and Jesus were fit earlier in the campaign.',
  'image': 'https: //static.bangkokpost.com/media/content/20250405/c1_2996436_700.jpg',
  'site_url': 'https: //www.bangkokpost.com/sports/2996436/arsenal-draw-at-everton-leaves-liverpool-smiling',
  'publish_date': '5 Apr 2025',
  'publish_time': '21: 20'
    }
]