{
    'title': 'China hits back with 34% tariffs on all US goods',
    
    'description': 'China retaliated on Friday against new US tariffs with a series of measures, including 34% levies on all American imports and export controls on rare earths, escalating the trade fight that has sent global markets reeling.',
    
    'content': 'China retaliated on Friday against new US tariffs with a series of measures, including 34% levies on all American imports and export controls on rare earths, escalating the trade fight that has sent global markets reeling. Beijing will impose a 34% tariff on all imports from the US starting on April 10, matching the so-called reciprocal tariffs that President Donald Trump announced on Chinese products. The Chinese measures, announced on a holiday, followed Trump’s announcement of reciprocal tariffs on global trade partners, introducing the steepest American duties in a century. The latest US tariffs will raise levies on nearly all Chinese products to at least 54%, potentially crippling Chinese exports to the US. Tensions between Washington and Beijing have worsened since Trump’s return to the White House. The US president has yet to speak with his Chinese counterpart more than two months after his inauguration. Both countries are locked in a stalemate over China’s alleged role in the flow of fentanyl into America, which Trump cited as a reason for the previous two rounds of tariffs. “The speed in which the countermeasures were rolled out shows a high level of deliberation and a suite of appropriate responses to hit back at the US,” said Dylan Loh, assistant professor at the Nanyang Technological University in Singapore. “It strikes the balance between inflicting some pain but not being seen as a overreaction.” European stocks plunged and headed for a correction after China’s announcement. US stock-index futures also extended losses, sending contracts on the S&P 500 down 2.2% in New York. Before this week’s announcement, the tariff imbalance between the US and China was stark: American duties on Chinese goods towered over the tariffs China charges the US. China’s average tariff on US goods stood at 17.8%, less than the 32.8% the US charged on Chinese goods, according to a Bloomberg Economics analysis. Last year, China imported almost $164 billion worth of goods from the US, the lowest amount in four years. “The US action does not abide by international trade rules, severely undermines China’s legitimate and lawful rights and interests, and is typical unilateral bullying,” the Finance Ministry said in a statement announcing the 34% tariffs. The economic conflict between the two governments has extended to private companies in both countries. Chinese officials have pushed back against Walmart’s efforts to pressure Chinese suppliers to cut prices to offset Trump’s tariffs. Hong Kong tycoon Li Ka-shing, meanwhile, drew Beijing’s ire by agreeing to sell his company’s ports in Panama, a move criticised as an attempt to appease Trump. Trump justified his new tariffs as a fair way to match the barriers that other countries enact on US firms and goods. His administration has also accused China of erecting non-tariff barriers that disadvantage US exports and companies, complaints that were laid out in a report published by the US Trade Representative this week. The latest measures reflect China’s message to the Trump administration that both sides are equal, and Beijing will not simply submit or accept the situation, said Wen-Ti Sung, a non-resident fellow at the Global China Hub of the Atlantic Council. Still, China is leaving some “off-ramp”, he said. “China’s retaliation seems still proportional and targeted by design, focusing mainly on agricultural goods and defence contractors, both of which are key Trump coalition constituencies.”',
    
    'image': 'https: //static.bangkokpost.com/media/content/20250404/c1_2995971_250404191731_700.jpg',
    
    'site_url': 'https: //www.bangkokpost.com/business/general/2995971/china-hits-back-with-34-tariffs-on-all-us-goods'
}