{
    "items": [
        {
            "content": "KYIV - Russia and Ukraine traded a barrage of drone strikes overnight on Wednesday, in attacks that killed two in Kyiv and forced Moscow to shut major airports hours before a swathe of foreign leaders was to arrive. The Kremlin has announced a unilateral three-day truce — set to start at 2100 GMT on Wednesday — to coincide with its grand May 9 military parade on Red Square, marking 80 years since the defeat of Nazi Germany in World War II. Chinese President Xi Jinping and Brazil’s Luiz Inacio Lula da Silva are among 29 foreign leaders expected in Moscow to mark the occasion, which has become Russia’s most important public holiday under President Vladimir Putin. Ukraine has dismissed Putin’s order to his troops to halt their attacks as a “manipulation” and “game” designed to protect his parade rather than a genuine peace measure. Ukrainian President Volodymyr Zelensky is calling for an unconditional 30-day ceasefire — a proposal back by US President Donald Trump and previously rejected by Putin. Zelensky called for more pressure on Moscow to end its invasion. “Only significantly intensified pressure on Russia and stronger sanctions can pave the way to diplomacy. Any measures depriving the aggressor of resources to wage war must be implemented to bring lasting peace,” Zelensky said on social media. Hours before Putin’s order was set to come into effect, Russia unleashed a barrage of drone attacks across Ukraine. Zelensky said Russia fired 142 drones and four ballistic missiles. “Unfortunately, there are fatalities — a woman and her son,” Zelensky said, referring to the Kyiv attack. The emergency services said falling debris from a drone attack on the central Shevchenkivsky district sparked a fire in an apartment block. AFP journalists in the capital heard loud explosions over the city at around 1am local time. In the morning, a first-aid tent had been erected next to the charred facade of the building, blackened by the fire and with windows blown out on its top floors. Men in camouflage were inspecting debris from a fallen drone part. Attempted drone attacks by Ukraine across Russia triggered hours of travel chaos, as airports across the western part of the country were repeatedly closed on Tuesday and the early hours of Wednesday. Arrivals and departures from Moscow’s main Sheremetyevo international airport were suspended for hours overnight, aviation authorities said. “The restrictions were imposed to ensure the safety of civil aircraft flights,” Artyom Korenyako, press secretary for the Federal Aviation Transport Agency, wrote on Telegram. Moscow regularly halts air traffic in areas where its air defence systems are operating, but the scale of the forced closures has escalated significantly in the run-up to Friday’s parade. Russia’s defence ministry reported downing dozens of Ukrainian drones targeting the country, including Moscow, on Tuesday and Wednesday. Ukraine claimed it had hit a fibre-optic plant in Saransk, a central Russian city far from the borders, where the authorities announced a state of emergency, cancelling all lessons in schools — but without confirming damage to the plant. Numerous unverified photos and videos on social media shared by locals showed smoke rising from an industrial building and multiple drone flyovers. On the streets of Moscow, AFP reporters noticed a significant police presence, and mobile internet in the capital was being jammed. Since Russia invaded in February 2022, Ukraine has on several occasions launched attacks at the Russian capital and other major cities and infrastructure sites hundreds of miles from its border. Kyiv calls it fair retaliation for Moscow’s daily missile and drone barrages on its own cities. Tens of thousands have been killed since Russia invaded, with towns and cities across Ukraine’s south and east levelled under intense Russian aerial attacks. Moscow’s army controls around 20 percent of the country, including the Crimean peninsula it annexed in 2014. A wave of deadly Russian ballistic missile strikes on civilian areas in April triggered fresh outrage in Kyiv and saw Trump issue a rare rebuke to Putin. Ukraine has said it cannot be held responsible for the safety of foreign leaders visiting Moscow for the parade, in an apparent rejection of Putin’s truce proposal.",
            "summary": "Ukraine and Russia exchanged intense drone strikes, resulting in fatalities in Kyiv and temporary airport closures in Moscow ahead of Russia's May 9 military parade. Russia declared a three-day truce for the parade, which Ukraine criticized as a manipulation. Ukraine's President Zelensky called for intensified pressure and sanctions on Russia to end the invasion. The ongoing conflict has led to significant casualties and destruction, with Ukraine launching retaliatory attacks on Russian cities.",
            "publishedAt": "2025-05-07 17:45:00",
            "category": "Conflict",
            "source": "https://www.bangkokpost.com/world/3019865/ukraine-russia-trade-attacks-ahead-of-moscow-parade",
            "article_id": "da642d62-6ffa-4934-aa49-e41f638ddeeb",
            "image_url": "https://static.bangkokpost.com/media/content/20250507/c1_5594560_700.jpg",
            "description": "KYIV - Russia and Ukraine traded a barrage of drone strikes overnight on Wednesday, in attacks that killed two in Kyiv and forced Moscow to shut major airports hours before a swathe of foreign leaders was to arrive.",
            "title": "Ukraine, Russia trade attacks ahead of Moscow parade"
        },
        {
            "content": "Retail prices of fuel remain unchanged in Thailand despite a decision to increase the fuel excise tax by 15%, according to Energy Minister Pirapan Salirathavibhaga. The agencies responsible have adjusted prices by reducing motorists’ contributions to the state Oil Fuel Fund, he said. Excise tax and levies paid to support the oil fund are among the key components of domestic oil prices. Changes in excise tax rates and contributions to the fund are made occasionally to control prices. Effective from Wednesday, the excise tax rate on gasohol 95  will rise to 6.70 baht from from 5.85 baht a litre), gasohol E20 to 6 baht from 5.20 baht, and diesel to 6.92 baht from 5.99 baht. To offset the impact of the tax increase, the board of Oil Fuel Fund Office resolved to reduce fuel users’ contributions to the Oil Fuel Fund by between 11% and 15%. Contributions for gasohol 95 fall by 15% to 3.70 baht a litre; gasohol E20 by 11% to 2.40 baht and diesel by 12% to 3 baht a litre. “The move is aimed at preventing retail fuel prices from increasing in order to help people control their living costs at a time the economy has yet to fully recover,” said Mr Pirapan. The lower contributions will be applied at least until Sept 30, which is the end of fiscal 2025, said Pornchai Jirakulpaisal, director for policy and strategy at the Office of the Oil Fuel Fund. If global oil prices increase significantly, the Office will ask the Excise Department to reduce the tax rate, he said. The lower contributions will reduce the fund’s revenue by 49.5 million baht a day from the current average of 394 million baht. As of May 5, the fund had run up a loss of 47.8 billion baht from subsidising diesel and cooking gas prices.",
            "summary": "Despite a 15% increase in fuel excise tax in Thailand, retail fuel prices remain unchanged as the government reduces contributions to the Oil Fuel Fund to offset the tax impact. This measure aims to stabilize living costs amid an economic recovery. The reduction in contributions will be effective until the end of the fiscal year 2025, potentially leading to a daily revenue loss for the fund.",
            "publishedAt": "2025-05-07 16:58:00",
            "category": "Economy",
            "source": "https://www.bangkokpost.com/business/general/3019941/thai-fuel-prices-unchanged-despite-tax-hike",
            "article_id": "8fe2d8fd-5143-40f3-91ac-924de6af54df",
            "image_url": "https://static.bangkokpost.com/media/content/20250507/c1_3019941_250507172314_700.jpg",
            "description": "Retail prices of fuel remain unchanged in Thailand despite a decision to increase the fuel excise tax by 15%, according to Energy Minister Pirapan Salirathavibhaga.",
            "title": "Thai fuel prices unchanged despite tax hike"
        },
        {
            "content": "NAKHON RATCHASIMA - There is enough water in Lam Takhong reservoir to ensure adequate tap water for five nearby districts for the next two months, a senior official said on Wednesday. Sukhon Temyodying, director of the Lam Takhong Operation and Maintenance Project, said the dam reservoir was currently holding 449.33 million cubic metres of water, 15.69% of its design capacity. Of this, 26.61 million cubic metres was for tap water production.   Water was being released at about 130,000 cubic metres per day, he said. The reservoir supplies water to five districts - Sikhiu, Sung Noen, Kham Thalae So, Muang and Chalerm Prakiat. Residents have expressed fears  of a possible water shortage this year. Mr Sukhon gave an assurance the reservoir had sufficient water for domestic supply. Even without rainfall, there was enough water to last until mid-July. Irrigation officials had closely monitored and managed the water supply during the dry season, he said.  He said Deputy Prime Minister Prasert Chanthararuangthong, who is chairman of the National Water Resources Committee, had inspected the water situation in Nakhon Ratchasima during a visit on May 3.  Mr Praasert, also digital economy and society minister, had instructed the Irrigation Department to efficiently manage the water resources of the four major reservoirs in the province - Lam Takhong, Lam Phra Phloeng, Mun Bon and Lam Chae. Water management measures were in place to allocate water resources to meet demand, with priority given to household use, Mr Sukhon said. The Department of Royal Rainmaking and Agricultural Aviation had been instructed to carry out rainmaking flights to increase the water volume in all reservoirs and in particular Lam Takhongr, which is the main water source for the province.",
            "summary": "The Lam Takhong reservoir in Nakhon Ratchasima has sufficient water to supply tap water to five districts for the next two months, despite being at 15.69% of its capacity. Authorities are managing the water supply closely and plan to conduct rainmaking flights to ensure water availability.",
            "publishedAt": "2025-05-07 17:09:00",
            "category": "Environment",
            "source": "https://www.bangkokpost.com/thailand/general/3019931/adequate-water-in-lam-takhong-reservoir-for-next-2-months",
            "article_id": "dbd59fe5-d61e-44ab-913e-f7c27789c0fd",
            "image_url": "https://static.bangkokpost.com/media/content/20250507/c1_3019931_700.jpg",
            "description": "NAKHON RATCHASIMA - There is enough water in Lam Takhong reservoir to ensure adequate tap water for five nearby districts for the next two months, a senior official said on Wednesday.",
            "title": "Adequate water in Lam Takhong reservoir for next 2 months"
        },
        {
            "content": "KYIV - Russia and Ukraine traded a barrage of drone strikes overnight on Wednesday, in attacks that killed two in Kyiv and forced Moscow to shut major airports hours before a swathe of foreign leaders was to arrive. The Kremlin has announced a unilateral three-day truce — set to start at 2100 GMT on Wednesday — to coincide with its grand May 9 military parade on Red Square, marking 80 years since the defeat of Nazi Germany in World War II. Chinese President Xi Jinping and Brazil’s Luiz Inacio Lula da Silva are among 29 foreign leaders expected in Moscow to mark the occasion, which has become Russia’s most important public holiday under President Vladimir Putin. Ukraine has dismissed Putin’s order to his troops to halt their attacks as a “manipulation” and “game” designed to protect his parade rather than a genuine peace measure. Ukrainian President Volodymyr Zelensky is calling for an unconditional 30-day ceasefire — a proposal back by US President Donald Trump and previously rejected by Putin. Zelensky called for more pressure on Moscow to end its invasion. “Only significantly intensified pressure on Russia and stronger sanctions can pave the way to diplomacy. Any measures depriving the aggressor of resources to wage war must be implemented to bring lasting peace,” Zelensky said on social media. Hours before Putin’s order was set to come into effect, Russia unleashed a barrage of drone attacks across Ukraine. Zelensky said Russia fired 142 drones and four ballistic missiles. “Unfortunately, there are fatalities — a woman and her son,” Zelensky said, referring to the Kyiv attack. The emergency services said falling debris from a drone attack on the central Shevchenkivsky district sparked a fire in an apartment block. AFP journalists in the capital heard loud explosions over the city at around 1am local time. In the morning, a first-aid tent had been erected next to the charred facade of the building, blackened by the fire and with windows blown out on its top floors. Men in camouflage were inspecting debris from a fallen drone part. Attempted drone attacks by Ukraine across Russia triggered hours of travel chaos, as airports across the western part of the country were repeatedly closed on Tuesday and the early hours of Wednesday. Arrivals and departures from Moscow’s main Sheremetyevo international airport were suspended for hours overnight, aviation authorities said. “The restrictions were imposed to ensure the safety of civil aircraft flights,” Artyom Korenyako, press secretary for the Federal Aviation Transport Agency, wrote on Telegram. Moscow regularly halts air traffic in areas where its air defence systems are operating, but the scale of the forced closures has escalated significantly in the run-up to Friday’s parade. Russia’s defence ministry reported downing dozens of Ukrainian drones targeting the country, including Moscow, on Tuesday and Wednesday. Ukraine claimed it had hit a fibre-optic plant in Saransk, a central Russian city far from the borders, where the authorities announced a state of emergency, cancelling all lessons in schools — but without confirming damage to the plant. Numerous unverified photos and videos on social media shared by locals showed smoke rising from an industrial building and multiple drone flyovers. On the streets of Moscow, AFP reporters noticed a significant police presence, and mobile internet in the capital was being jammed. Since Russia invaded in February 2022, Ukraine has on several occasions launched attacks at the Russian capital and other major cities and infrastructure sites hundreds of miles from its border. Kyiv calls it fair retaliation for Moscow’s daily missile and drone barrages on its own cities. Tens of thousands have been killed since Russia invaded, with towns and cities across Ukraine’s south and east levelled under intense Russian aerial attacks. Moscow’s army controls around 20 percent of the country, including the Crimean peninsula it annexed in 2014. A wave of deadly Russian ballistic missile strikes on civilian areas in April triggered fresh outrage in Kyiv and saw Trump issue a rare rebuke to Putin. Ukraine has said it cannot be held responsible for the safety of foreign leaders visiting Moscow for the parade, in an apparent rejection of Putin’s truce proposal.",
            "summary": "Ukraine and Russia exchanged drone strikes overnight, resulting in two deaths in Kyiv and causing Moscow to shut down major airports. This occurred just before Russia's planned military parade on May 9, marking 80 years since the defeat of Nazi Germany. Despite Russia's declaration of a temporary ceasefire for the parade, Ukraine dismissed it as manipulation, with President Zelensky calling for a 30-day ceasefire supported by US President Trump. The ongoing conflict has seen multiple attacks and significant casualties, with Ukraine insisting on intensified pressure and sanctions against Russia.",
            "publishedAt": "2025-05-07 17:45:00",
            "category": "Conflict",
            "source": "https://www.bangkokpost.com/world/3019865/ukraine-russia-trade-attacks-ahead-of-moscow-parade",
            "article_id": "9b95e760-0c2e-48e7-8808-aa3ac946200b",
            "image_url": "https://static.bangkokpost.com/media/content/20250507/c1_5594560_700.jpg",
            "description": "KYIV - Russia and Ukraine traded a barrage of drone strikes overnight on Wednesday, in attacks that killed two in Kyiv and forced Moscow to shut major airports hours before a swathe of foreign leaders was to arrive.",
            "title": "Ukraine, Russia trade attacks ahead of Moscow parade"
        },
        {
            "content": "American academic Paul Chambers is appealing the termination of his employment contract by Naresuan University on grounds that it was made without due process, according to Thai Lawyers for Human Rights (TLHR). Mr Chambers was recently embroiled in a lese-majeste case but prosecutors decided not to indict him after concluding that the complainants’ case lacked grounds. However, his future in Thailand remains uncertain. His visa was revoked shortly after he was charged last month under Section 112 of the Criminal Code, the lese-majeste law. Termination of his teaching job would also result in automatic cancellation of his work permit. Mr Chambers has lived in Thailand since 1993 and is well-known in academic circles as a commentator on civil-military relations and democracy in Asia, with a special focus on Thailand. Panu Bhuddhawong, vice-rector of administration at Naresuan University, acting in the rector’s stead, signed two separate notices to terminate Mr Chambers’ employment on April 21 and 24, according to TLHR.. The termination was made retroactive to April 9, the day Mr Chambers’ visa was revoked, and a day after he met prosecutors in Phitsanulok province to acknowledge the charges against him. TLHR said on Wednesday that Mr Panu overstepped his authority as his duty to act on behalf of the rector of the university in Phitsanulok does not cover termination of employment.  Furthermore, university regulations allow termination only in cases of serious misconduct or failure to meet qualifications, neither of which applied to Mr Chambers, who was also stripped of the opportunity to explain his case, the lawyers’ group said in a statement. The vice-rector should have set up a committee to investigate the conduct of an employee before proceeding any further, the statement said. The lawyers said Mr Chambers’ contract stipulates certain conditions, such as failure to pass a job evaluation, which did not apply in this case. As well, it calls for three months’ notice of contract termination. The complaint against the academic reportedly centred on a notice for an academic webinar organised by the ISEAS–Yusof Ishak Institute in Singapore on Thailand’s military and police reshuffles. It listed Mr Chambers, a recognised expert on the topic, as a speaker. Mr Chambers, 58, said he neither wrote nor published the text, which has since been taken down from the Institute’s website. Prosecutors in Phitsanulok said on May 1 that they had reviewed the evidence supplied by police, who had received the original complaint from the Third Army Region, and concluded it did not support further action under Section 112. It is still possible, though unlikely, that Provincial Police Region 6 could contest the decision and seek to pursue the charge again. Even though the court returned Mr Chambers’ passport after prosecutors announced their decision, Phitsanulok immigration officials have seized it again pending a review of his status, TLHR said. If an immigration review committee determines that the visa revocation should stand, Mr Chambers risks being deported from the kingdom.",
            "summary": "American scholar Paul Chambers is challenging his dismissal from Naresuan University in Thailand, arguing it was executed without due process. His termination followed a lese-majeste case, which was not pursued by prosecutors due to insufficient grounds. Chambers, known for his expertise on civil-military relations in Thailand, faces potential deportation after his visa was revoked, although his work permit cancellation is disputed. Thai Lawyers for Human Rights assert that his dismissal failed to follow procedural regulations, lacking investigation and proper notice.",
            "publishedAt": "2025-05-07 16:27:00",
            "category": "Legal",
            "source": "https://www.bangkokpost.com/thailand/general/3019881/thailand-based-us-scholar-contests-illegal-dismissal",
            "article_id": "8501afa4-0565-4153-ba65-e9f6394d08d4",
            "image_url": "https://static.bangkokpost.com/media/content/20250507/c1_3019881_250507160435_700.jpg",
            "description": "American academic Paul Chambers is appealing the termination of his employment contract by Naresuan University on grounds that it was made without due process, according to Thai Lawyers for Human Rights (TLHR).",
            "title": "Thailand-based US scholar contests ‘illegal’ dismissal"
        },
        {
            "content": "COPENHAGEN - The  multinational jewellery maker Pandora, which employs about 13,000 people in Thailand, says it has been gaining market share in the United States and plans to keep investing to win new customers there despite the possibility of high import tariffs. “US consumer demand for the category is not super strong, but the demand for Pandora has been very strong,” CEO Alexander Lacik told Reuters on Wednesday after Pandora announced its results. He said that could change, though, if steep US tariffs on many countries return. “If that happens and the demand generally goes down in the US, of course we’ll have to kind of rethink our plan a little bit. But at this moment in time, we’re punching away because it’s working,” Lacik said. Pandora, listed on the Nasdaq OMX in Copenhagen, reported a first-quarter net profit of 1.1 billion Danish krone (US$168 million), compared with 965 krone in the same period a year earlier. Sales rose 7.3% year-on-year to 7.3 billion krone. The United States accounted for 32% of Pandora’s revenue in the first quarter, and comparable sales there grew by 11%, making it the strongest major market for the brand. US so-called “reciprocal” tariffs, including a 36% tariff on Thailand, would add tens of millions of dollars to Pandora’s annual costs, as the company manufactures its charm bracelets and necklaces at two factories in Thailand. Lacik said he welcomed any efforts to provide stability on trade, as the US and China announced trade talks to take place in Geneva on Saturday. After hiking prices by an average of 5% in October and a further 4% in April to account for higher silver prices, Lacik said Pandora has not yet decided on further price increases. “It could be that we move the pricing globally, it could be that we move a bit more in the US, today I don’t know,” he said, adding that Pandora will stick to its “affordable” position relative to rivals. Pandora employs about 13,200 people in Thailand, primarily in its two manufacturing facilities located in Bangkok and Lamphun.  The company still aims to open a new factory in Vietnam next year, Lacik said. High labour costs and a lack of specialised craftspeople make manufacturing in the US impossible while maintaining profitability, he said. “Even if you have these very high tariffs in the US I still probably wouldn’t change my supply strategy,” he said.",
            "summary": "Jewellery maker Pandora is optimistic about its growth in the US market, despite potential high import tariffs. The company has been gaining market share and will continue investing to attract new customers. Pandora's US revenue accounted for 32% of its first-quarter earnings, with a significant sales growth of 11%. The company plans to maintain its affordable pricing strategy despite rising costs and is considering global pricing adjustments. CEO Alexander Lacik expressed concern over potential tariffs but remains committed to the current supply strategy due to high US labour costs. Pandora is also planning to open a new factory in Vietnam.",
            "publishedAt": "2025-05-07 16:04:00",
            "category": "Business",
            "source": "https://www.bangkokpost.com/business/general/3019891/jewellery-maker-pandora-bullish-on-us-despite-tariffs",
            "article_id": "8973b0ee-5821-40a0-a006-56671839534c",
            "image_url": "https://static.bangkokpost.com/media/content/20250507/c1_3019891_700.jpg",
            "description": "COPENHAGEN - The multinational jewellery maker Pandora , which employs about 13,000 people in Thailand , says it has been gaining market share in the United States and plans to keep investing to win new customers there despite the possibility of high import tariffs.",
            "title": "Jewellery maker Pandora bullish on US despite tariffs"
        },
        {
            "content": "American academic Paul Chambers is appealing the termination of his employment contract by Naresuan University on grounds that it was made without due process, according to Thai Lawyers for Human Rights (TLHR). Mr Chambers was recently embroiled in a lese-majeste case but prosecutors decided not to indict him after concluding that the complainants’ case lacked grounds. However, his future in Thailand remains uncertain. His visa was revoked shortly after he was charged last month under Section 112 of the Criminal Code, the lese-majeste law. Termination of his teaching job would also result in automatic cancellation of his work permit. Mr Chambers has lived in Thailand since 1993 and is well-known in academic circles as a commentator on civil-military relations and democracy in Asia, with a special focus on Thailand. Panu Bhuddhawong, vice-rector of administration at Naresuan University, acting in the rector’s stead, signed two separate notices to terminate Mr Chambers’ employment on April 21 and 24, according to TLHR.. The termination was made retroactive to April 9, the day Mr Chambers’ visa was revoked, and a day after he met prosecutors in Phitsanulok province to acknowledge the charges against him. TLHR said on Wednesday that Mr Panu overstepped his authority as his duty to act on behalf of the rector of the university in Phitsanulok does not cover termination of employment.  Furthermore, university regulations allow termination only in cases of serious misconduct or failure to meet qualifications, neither of which applied to Mr Chambers, who was also stripped of the opportunity to explain his case, the lawyers’ group said in a statement. The vice-rector should have set up a committee to investigate the conduct of an employee before proceeding any further, the statement said. The lawyers said Mr Chambers’ contract stipulates certain conditions, such as failure to pass a job evaluation, which did not apply in this case. As well, it calls for three months’ notice of contract termination. The complaint against the academic reportedly centred on a notice for an academic webinar organised by the ISEAS–Yusof Ishak Institute in Singapore on Thailand’s military and police reshuffles. It listed Mr Chambers, a recognised expert on the topic, as a speaker. Mr Chambers, 58, said he neither wrote nor published the text, which has since been taken down from the Institute’s website. Prosecutors in Phitsanulok said on May 1 that they had reviewed the evidence supplied by police, who had received the original complaint from the Third Army Region, and concluded it did not support further action under Section 112. It is still possible, though unlikely, that Provincial Police Region 6 could contest the decision and seek to pursue the charge again. Even though the court returned Mr Chambers’ passport after prosecutors announced their decision, Phitsanulok immigration officials have seized it again pending a review of his status, TLHR said. If an immigration review committee determines that the visa revocation should stand, Mr Chambers risks being deported from the kingdom.",
            "summary": "American academic Paul Chambers is contesting his dismissal from Naresuan University in Thailand, claiming it was done without due process. His termination followed a lese-majeste case where prosecutors opted not to indict him due to insufficient grounds. Despite the legal reprieve, his visa was revoked, impacting his ability to remain in Thailand. The Thai Lawyers for Human Rights argue that the dismissal did not follow university protocol and lacked justification, as Chambers was not involved in any serious misconduct. His employment termination and visa issues stem from the controversy surrounding an academic webinar notice.",
            "publishedAt": "2025-05-07 16:27:00",
            "category": "Legal",
            "source": "https://www.bangkokpost.com/thailand/general/3019881/thailand-based-us-scholar-contests-illegal-dismissal",
            "article_id": "a1d9ed27-b174-4a99-9e02-2192787a1dd3",
            "image_url": "https://static.bangkokpost.com/media/content/20250507/c1_3019881_250507160435_700.jpg",
            "description": "American academic Paul Chambers is appealing the termination of his employment contract by Naresuan University on grounds that it was made without due process, according to Thai Lawyers for Human Rights (TLHR).",
            "title": "Thailand-based US scholar contests ‘illegal’ dismissal"
        },
        {
            "content": "Retail prices of fuel remain unchanged in Thailand despite a decision to increase the fuel excise tax by 15%, according to Energy Minister Pirapan Salirathavibhaga. The agencies responsible have adjusted prices by reducing motorists’ contributions to the state Oil Fuel Fund, he said. Excise tax and levies paid to support the oil fund are among the key components of domestic oil prices. Changes in excise tax rates and contributions to the fund are made occasionally to control prices. Effective from Wednesday, the excise tax rate on gasohol 95  will rise to 6.70 baht from from 5.85 baht a litre), gasohol E20 to 6 baht from 5.20 baht, and diesel to 6.92 baht from 5.99 baht. To offset the impact of the tax increase, the board of Oil Fuel Fund Office resolved to reduce fuel users’ contributions to the Oil Fuel Fund by between 11% and 15%. Contributions for gasohol 95 fall by 15% to 3.70 baht a litre; gasohol E20 by 11% to 2.40 baht and diesel by 12% to 3 baht a litre. “The move is aimed at preventing retail fuel prices from increasing in order to help people control their living costs at a time the economy has yet to fully recover,” said Mr Pirapan. The lower contributions will be applied at least until Sept 30, which is the end of fiscal 2025, said Pornchai Jirakulpaisal, director for policy and strategy at the Office of the Oil Fuel Fund. If global oil prices increase significantly, the Office will ask the Excise Department to reduce the tax rate, he said. The lower contributions will reduce the fund’s revenue by 49.5 million baht a day from the current average of 394 million baht. As of May 5, the fund had run up a loss of 47.8 billion baht from subsidising diesel and cooking gas prices.",
            "summary": "Thailand's retail fuel prices remain unchanged despite a 15% increase in fuel excise tax due to reduced contributions to the state Oil Fuel Fund. This adjustment aims to stabilize fuel prices and help control living costs amid economic recovery. The reduced contributions will continue until the end of fiscal 2025, impacting the fund's revenue by 49.5 million baht daily.",
            "publishedAt": "2025-05-07 16:58:00",
            "category": "Economics",
            "source": "https://www.bangkokpost.com/business/general/3019941/thai-fuel-prices-unchanged-despite-tax-hike",
            "article_id": "4e536b88-634d-4f99-a83a-fa4de6bf49e6",
            "image_url": "https://static.bangkokpost.com/media/content/20250507/c1_3019941_250507172314_700.jpg",
            "description": "Retail prices of fuel remain unchanged in Thailand despite a decision to increase the fuel excise tax by 15%, according to Energy Minister Pirapan Salirathavibhaga.",
            "title": "Thai fuel prices unchanged despite tax hike"
        },
        {
            "content": "NAKHON RATCHASIMA - There is enough water in Lam Takhong reservoir to ensure adequate tap water for five nearby districts for the next two months, a senior official said on Wednesday. Sukhon Temyodying, director of the Lam Takhong Operation and Maintenance Project, said the dam reservoir was currently holding 449.33 million cubic metres of water, 15.69% of its design capacity. Of this, 26.61 million cubic metres was for tap water production.   Water was being released at about 130,000 cubic metres per day, he said. The reservoir supplies water to five districts - Sikhiu, Sung Noen, Kham Thalae So, Muang and Chalerm Prakiat. Residents have expressed fears  of a possible water shortage this year. Mr Sukhon gave an assurance the reservoir had sufficient water for domestic supply. Even without rainfall, there was enough water to last until mid-July. Irrigation officials had closely monitored and managed the water supply during the dry season, he said.  He said Deputy Prime Minister Prasert Chanthararuangthong, who is chairman of the National Water Resources Committee, had inspected the water situation in Nakhon Ratchasima during a visit on May 3.  Mr Praasert, also digital economy and society minister, had instructed the Irrigation Department to efficiently manage the water resources of the four major reservoirs in the province - Lam Takhong, Lam Phra Phloeng, Mun Bon and Lam Chae. Water management measures were in place to allocate water resources to meet demand, with priority given to household use, Mr Sukhon said. The Department of Royal Rainmaking and Agricultural Aviation had been instructed to carry out rainmaking flights to increase the water volume in all reservoirs and in particular Lam Takhongr, which is the main water source for the province.",
            "summary": "The Lam Takhong reservoir in Nakhon Ratchasima has enough water to supply tap water to five districts for the next two months, despite being only 15.69% full. The reservoir currently holds 449.33 million cubic metres of water, with 26.61 million cubic metres designated for tap water production. Officials are managing water resources carefully, and rainmaking efforts are planned to boost reservoir levels.",
            "publishedAt": "2025-05-07 17:09:00",
            "category": "Environment",
            "source": "https://www.bangkokpost.com/thailand/general/3019931/adequate-water-in-lam-takhong-reservoir-for-next-2-months",
            "article_id": "bb815693-5bc0-4f4a-9416-17aa1d86c298",
            "image_url": "https://static.bangkokpost.com/media/content/20250507/c1_3019931_700.jpg",
            "description": "NAKHON RATCHASIMA - There is enough water in Lam Takhong reservoir to ensure adequate tap water for five nearby districts for the next two months, a senior official said on Wednesday.",
            "title": "Adequate water in Lam Takhong reservoir for next 2 months"
        }
    ],
    "lastKey": null
}